Revit 2027 API
CameraInfo.TargetDistance Property
 Distance from eye point along view direction to target plane.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double TargetDistance { get; }
Public ReadOnly Property TargetDistance As Double
	Get
public:
property double TargetDistance {
	double get ();
}
member TargetDistance : float with get
Property Value
Double
Remarks
 This value is appropriate for perspective views only. Attempts to get this value for an orthographic view can be made, but the obtained value is to be ignored.
See Also
Reference
CameraInfo Class
Autodesk.Revit.DB Namespace